import os

CHANNEL_ID = -69197763576019
MAX_BOT_TOKEN = os.getenv("MAX_BOT_TOKEN") or os.getenv("MAX_TOKEN") or os.getenv("BOT_TOKEN")
BOT_TOKEN = os.getenv("MAX_BOT_TOKEN") or os.getenv("MAX_TOKEN") or os.getenv("BOT_TOKEN")

# --- ССЫЛКИ ---
CHANNEL_URL = "https://max.ru/id3015041260_gos"
SITE_URL = "https://olimpreserv1-30.ru/"
FORM_URL = "https://pos.gosuslugi.ru/landing/"

# --- ТЕКСТЫ ---
TEXT_SUBSCRIBE = (
    "Для того чтобы продолжить использовать бот, необходимо подписаться на канал\n"
    "ГБУ ДО АО «СШОР №1».\n\n"
    "Для этого нажмите «Открыть канал» или перейдите по ссылке:\n"
    f"{CHANNEL_URL}\n\n"
    "Затем вернитесь в чат-бот и нажмите «Я подписан»."
)

TEXT_WELCOME = (
    "Добро пожаловать в чат-бот ГБУ ДО АО «СШОР №1»!\n\n"
    "Выберите нужную категорию:"
)

TEXT_ABOUT = (
    "ГБУ ДО АО «Спортивная школа олимпийского резерва №1» была основана в 1949 году. В то далекое время она называлась «Детская спортивная школа №1» и являлась единственной спортивной школой в системе образования Астраханской области, которая включала в себя различные виды спорта.\n"
    "В 1972 году открылось отделение спортивной акробатики\n"
    "В 2009 году по инициативе губернатора Астраханской области было открыто отделение прыжков на батуте.\n"
    "На сегодняшний день в нашей школе развиваются три вида спорта: спортивная гимнастика (мужское и женское отделения), спортивная акробатика (парно-групповые упражнения), прыжки на батуте (ДМТ, АКД, индивидуальные прыжки, синхронные прыжки).\n"
    "За 70 лет существования школы подготовлено: 5 заслуженных мастеров спорта: Капиз Измайлов, Юрий Трубицин, Елена Кирянова, Мария Кофтун, Антон Глазков; 18 мастеров спорта международного класса и свыше 100 мастеров спорта СССР и России.\n"
)

TEXT_ADDRESSES = (
    "📍 **Адреса мест проведения учебно-тренировочных занятий**\n"
    "• г. Астрахань, ул. Советской милиции 5\n"
)

TEXT_PAID_SERVICES = (
    "💳 **Платные услуги**\n\n"
    "Здесь описаны платные услуги центра. Подробнее — на официальном сайте."
)

TEXT_CONTACTS = (
    "📞 **Контактная информация**\n\n"
    "• Телефон учебной части: +7 (8512) 24-91-30\n"
    "• Email: official@sshor1.astrobl.ru\n"
    "• Режим работы администрации: пн–пт,8:30–17:30"
)

TEXT_SUPPORT_MENU = (
    "❓ **Часто задаваемые вопросы**\n\n"
    "Выберите направление:"
)

SUPPORT_DATA = {
    "question_1": (
        "✅ **Ответ:**\n\n"
        "**на платную основу:**\n"
        "• от 4-х лет девочки, от 5-ти лет мальчики по виду спорта «Спортивная гимнастика»\n"
        "• от 4,5 лет девочки, от 5-ти лет мальчики по виду спорта «Прыжки на батуте»\n"
    ),
    "question_2": (
        "✅ **Ответ:**\n\n"
        "В учреждении реализуются:\n"
        "• Дополнительная образовательная программа спортивной подготовки по виду спорта «Спортивная гимнастика»;\n"
        "• Дополнительная образовательная программа спортивной подготовки по виду спорта «Прыжки на батуте»;\n"
        "• Дополнительная общеобразовательная общеразвивающая программа «Спортивная гимнастика»."
    ),
    "question_3": (
        "✅ **Ответ:**\n\n"
        "• Спортивная гимнастика;\n"
        "• Прыжки на батуте."
    ),
    "question_4": (
        "✅ **Ответ:**\n\n"
        "Два направления:\n"
        "• «Спортивная гимнастика»  - работа на снарядах: у мальчиков вольные упражнения, конь, кольца, опорный  прыжок, параллельные брусья, перекладина / у девочек опорный прыжок, разновысокие брусья, бревно, вольные упражнения.\n"
        "• «Прыжки на батуте» - индивидуальные прыжки на батуте, прыжки на двойном минитрампе, прыжки на акробатической дорожке."
    ),
}
